import { sortRandom } from "./Utils"

export default class Warlord {
  static showName(warlord) {
    return warlordTrans[warlord?.name]?.name || ""
  }

  static showKingdom(warlord) {
    switch (warlord.kingdom) {
      case "qun": return "อิสระ"
      case "wu": return "ง่อก๊ก"
      case "shu": return "จ๊กก๊ก"
      case "wei": return "วุยก๊ก"
      case "god": return "เทพ"
      default: return "??"
    }
  }

  static showDesc(warlord) {
    return warlordTrans[warlord.name]?.desc || ""
  }

  static hasSkillButton(warlord) {
    const warlords = ["tao_yin", "zuo_ci", "taishi_ci", "xun_yu", "zhu_rong", "deng_ai", "lubu_god", 
      "guan_yu_god", "zhou_tai", "lu_ji", "xu_you", "guanqiu_jian", "lu_zhi"]
    return warlords.includes(warlord.name)
  }

  static hasChallengePointButton(warlord) {
    const warlords = ["taishi_ci", "xun_yu", "zhu_rong"]
    return warlords.includes(warlord.name)
  }
}

const buildWarlord = (name, maxHp, kingdom, gender) => {
  return {
    name,
    maxHp,
    kingdom,
    gender
  }
}

export const randomWarlord = (warlords) => {
  return sortRandom(warlords)
}

export const warlordTrans = {
  hua_tuo: { name: "ฮัวโต๋", desc: "<strong>1. ปฐมพยาบาล</strong> คุณสามารถใช้การ์ดสีแดง (<span class='red'>❤</span>/<span class='red'>◆</span>) 1 ใบแทนการ์ด “เสบียง” ได้ (สามารถใช้ในรอบของคนอื่นได้) (ใช้ได้รอบละ 1 ครั้ง) <br /> <strong>2. ยาสวรรค์</strong> ในรอบของคุณ คุณสามารถทิ้งการ์ด 1 ใบ เพื่อเพิ่มพลังชีวิต 1 หน่วยให้แก่ขุนพลใดก็ได้ (ใช้ได้รอบละ 1 ครั้ง)" },
  lubu: { name: "ลิโป้", desc: "<strong>1. หนึ่งในใต้หล้า</strong> ทักษะติดตัว : หากคุณใช้การ์ด “โจมตี” คู่ต่อสู้ต้องใช้การ์ด “หลบหลีก” 2 ใบ เพื่อหักล้าง และในการ “ท้าสู้” คู่ต่อสู้ต้องใช้การ์ด “โจมตี” 2 ใบ ในการต่อสู้กับคุณ" },
  diao_chan: { name: "เตียวเสี้ยน", desc: "<strong>1. สาวงามยุยง</strong> ในขั้นตอนการเล่นการ์ด จั่วการ์ดตัดสิน หากได้การ์ดสีแดง  (<span class='red'>❤</span>/<span class='red'>◆</span>) คุณสามารถทิ้งการ์ด 1 ใบ แล้วเลือกขุนพลเพศชาย 2 คน ให้ “ท้าสู้” กัน โดยคุณเลือกได้ว่าจะให้ใครเป็นฝ่ายใช้การ์ด “โจมตี” ก่อน (ใช้ได้รอบละ 1 ครั้ง)  <br /> <strong>2. งามกลบแสงจันทร์</strong> คุณสามารถจั่วการ์ดได้ 1 ใบเมื่อจบรอบของคุณ" },
  hua_xiong: { name: "ฮัวหยง", desc: "<strong>1. ท้าทายซึ่งหน้า</strong> ทักษะติดตัว : ขุนพลที่ใช้การ์ด “โจมตี” สีแดง (<span class='red'>❤</span>/<span class='red'>◆</span>) ใส่คุณได้สำเร็จ สามารถฟื้นฟูพลังชีวิตได้ 1 หน่วย หรือ จั่วการ์ดได้ 1 ใบ <br /> <strong>2. รางวัลเกียรติยศ</strong> หากสังหารขุนพลจะได้รับการฟื้นฟู 1 หน่วย และได้จั่วการ์ด 2 ใบ" },
  yuan_shu: { name: "อ้วนสุด", desc: "<strong>1. จองหอง</strong> ในขั้นตอนการเตรียมการของจักรพรรดิ คุณสามารถจั่วการ์ดได้ 1 ใบ หากคุณเลือกที่จะจั่วการ์ด จักรพรรดิจะถือการ์ดได้น้อยลง 1 ใบในรอบนี้  <br /> <strong>2. ไฟริษยา</strong> หากจักรพรรติเหลือพลังชีวิตน้อยกว่าคุณ เปิดการ์ดตัดสินหากเป็นสีดำ (♣️/♠️) คุณจะได้รับการ์ดนั้น  <br /> <strong>3. คนทรยศ</strong> ขุนผลอื่นไม่สามารถใช้การ์ด “เสบียง” กับคุณได้" },
  
  lu_meng: { name: "ลิบอง", desc: "<strong>1. ยับยั้งชั่งใจ</strong> ถ้าคุณไม่ได้ใช้การ์ด “โจมตี” ในรอบของคุณ คุณสามารถข้ามขั้นตอนการทิ้งการ์ดได้ <br /> <strong>2. ชนะโดยไม่สู้</strong> การ์ด “ท้าสู้” ไม่มีผลกับคุณ" },
  da_qiao: { name: "ไต้เกี้ยว", desc: "<strong>1. โปรยสเน่ห์</strong> คุณสามารถใช้การ์ด (<span class='red'>◆</span>) แทนการ์ด “มีสุขลืมเมือง” ได้  <br /> <strong>2. ซบอกชาตรี</strong> เมื่อคุณเป็นเป้าหมายของการ์ด “โจมตี” จั่วการ์ดตัดสิน หากได้การ์ด (<span class='red'>❤</span>/<span class='red'>◆</span>) คุณสามารถทิ้งการ์ด 1 ใบ แล้วเลือกขุนพลเพศชายหนึ่งคนที่อยู่ในขอบเขตการโจมตีของคุณ ขุนพลที่ถูกเลือกจะตกเป็นเป้าหมายของการ์ด “โจมตี” แทน (ไม่สามารถใช้กับผู้โจมตีได้)" },
  gan_ning: { name: "กำเหลง", desc: "<strong>1. บ้าบิ่น</strong> คุณสามารถใช้การ์ดสีดำ (♣️/♠️) เป็นการ์ด “ถอนสะพาน” แทนได้ <br /> <strong>2. ซ่อมเรือ</strong> เมื่อมีขุนพลอื่นใช้การ์ด “ถอนสะพาน” คุณได้จั่วการ์ด 1 ใบ" },
  sun_shangxiang: { name: "ซุนฮูหยิน", desc: "<strong>1. แผนแต่งงาน</strong> ในขั้นตอนการเล่นการ์ด คุณสามารถทิ้งการ์ดในมือ 2 ใบ และเลือกขุนพลเพศชายที่พลังชีวิตไม่เต็มหนึ่งคนเพื่อฟื้นฟูพลังชีวิตของเขาและคุณ 1 หน่วย (ใช้ได้รอบละ 1 ครั้ง)  <br /> <strong>2. องค์หญิงน้อย</strong> เมื่อคุณสูญเสียการ์ดในพื้นที่ติดอุปกรณ์ คุณสามารถจั่วการ์ดได้ 2 ใบ" },
  huang_gai: { name: "อุยกาย", desc: "<strong>1. พลีชีพ</strong> ในขั้นตอนการเล่นการ์ด คุณสามารถจ่ายพลังชีวิต 1 หน่วย เพื่อจั่วการ์ด 3 ใบได้ แต่จะไม่สามารถใช้การ์ด “เสบียง“ ในรอบนั้นได้ (ใช้ได้ 1 ครั้งต่อรอบ) " },
  sun_quan: { name: "ซุนกวน", desc: "<strong>1. ถ่วงดุล</strong> ในขั้นตอนการเล่นการ์ด คุณสามารถทิ้งการ์ดกี่ใบก็ได้ 1 ครั้ง แล้วจั่วการ์ตตามจำนวนการ์ดที่ทิ้งไป <br /> <strong>2. ค้ำจุ้น</strong> ทักษะจักรพรรดิ : ถ้ามีขุนพลง่อก๊กใช้การ์ด “เสบียง” กับคุณ ตอนคุณใกล้ตาย คุณจะได้พลังชีวิตเพิ่มขึ้นอีก 1 หน่วย (เป็น 2 หน่วย)" },
  zhou_yu: { name: "จิวยี่", desc: "<strong>1. ยอดวีรชน</strong> คุณสามารถจั่วการ์ดเพิ่มได้ 1 ใบ <br /> <strong>2. บาดหมาง</strong> ในขั้นตอนการเล่นการ์ด คุณสามารถเลือกขุนพล 1 คน ให้ขุนพลคนนั้นเลือกมา 1 สีของการ์ด (ดำ/แดง) ให้เขาสุ่มหยิบการ์ดบนมือคุณ 1 ใบ ถ้าขุนพลนั้นทายผิดจะเสียพลังชีวิต 1 หน่วย (ใช้ได้รอบละ 1 ครั้ง) <br /><strong>3. กระอักเลือด</strong> หากขุนพลนั้นทายถูก และเขาคือจูกัดเหลียง คุณจะเสียพลังชีวิตแทน" },
  lu_xun: { name: "ลกซุน", desc: "<strong>1. อ่อนน้อมถ่อมตน</strong> ทักษะติดตัว : การ์ด “มีสุขลืมเมือง” และ “ลอบขโมย” ไม่สามารถใช้กับคุณได้  <br /> <strong>2. เชื่อมค่ายทดแทน</strong> เมื่อคุณใช้หรือเสียการ์ดใบสุดท้ายในมือ คุณสามารถจั่วการ์ดได้ 1 ใบ (ใช้ได้รอบละ 2 ครั้ง)" },

  cao_cao: { name: "โจโฉ", desc: "<strong>1. ไม่ยอมให้โลกทรยศ</strong> เมื่อคุณได้รับความเสียหาย คุณจะได้รับการ์ดที่ก่อให้เกิดความเสียหายกับคุณ <br /> <strong>2. ปกป้องราชันย์</strong> ทักษะจักรพรรดิ : เมื่อคุณต้องการใช้การ์ด “หลบหลีก” คุณสามารถขอให้ขุนพลวุยก๊ก ใช้การ์ด “หลบหลีก” แทนคุณได้ (ขุนพลคนนั้นเลือกได้ว่าจะใช้หรือไม่ใช้)" },
  guo_jia: { name: "กุยแก", desc: "<strong>1. คาดการณ์แม่นยำ</strong> ทุกครั้งที่เปิดการ์ดตัดสิน จะได้รับการ์ดที่เปิดนั้นด้วย <br /> <strong>2. คำสั่งเสีย</strong> หลังจากที่คุณได้รับความเสียหาย จั่วการ์ด 2 ใบ แล้วมอบให้แก่ขุนพลใดก็ได้ <br /> <strong>3. เป็นไปดั่งคาด</strong> เมื่อขุนพลอื่นเปิดการ์ดตัดสิน คุณสามารถหยิบการ์ดใบนั้นขึ้นมือ และให้ขุนพลเป้าหมาย เปิดการ์ดตัดสินใหม่อีกรอบ (ใช้ได้รอบละ 1 ครั้ง)" },
  sima_yi: { name: "สุมาอี้", desc: "<strong>1. กลยุทธ์โต้กลับ</strong> เมื่อคุณได้รับความเสียหาย คุณสามารถหยิบการ์ดจากผู้ที่สร้างความเสียหายแก่คุณได้ 1 ใบ (จะเป็นการ์ดบนมือ หรือการ์ดบนพื้นที่ติดอุปกรณ์ก็ได้) <br /> <strong>2. ลิขิตชะตา</strong> คุณสามารถใช้สัญลักษณ์ของการ์ดบนมือ แทนผลการเปิดการ์ดตัดสินของทุกคนได้ ยกเว้นการ์ดตัดสินจาก “กลยุทธ์ลูกโซ่” (การ์ดที่ถูกนำมาใช้ให้ทิ้ง)" },
  zhang_liao: { name: "เตียวเลี้ยว", desc: "<strong>1. จู่โจมฉับพลัน</strong> ในขั้นตอนการจั่วการ์ด คุณสามารถเลือกได้ว่าจะไม่จั่วการ์ดแล้วเลือกหยิบการ์ดบนมือ 1 ใบจากขุนพลอื่นไม่เกิน 2 คน <br /><strong>2. เปลี่ยนแผน</strong> ในขั้นตอนการเล่นการ์ด มอบการ์ดบนมือให้ขุนพล 2 คน คนละ 1 ใบ หากทำเช่นนั้นคุณจะได้จั่วการ์ด 2 ใบ" },
  xu_chu: { name: "เคาทู", desc: "<strong>1. ฆ่าเสือมือเปล่า</strong> ในขั้นตอนการจั่วการ์ด ถ้าคุณเลือกจั่วการ์ดเพียง 1 ใบ ในรอบนั้นหากคุณใช้การ์ด “โจมตี” หรือการ์ด “ท้าสู้” สร้างความเสียหาย ความเสียหายจะเพิ่มขึ้น 1 หน่วย <br /><strong>2. ปัดเกาทัณฑ์</strong> ปกป้องขุนพลอื่น 1 คน ไม่ไห้ได้รับความเสียหายจากการ์ด “เกาทัณฑ์พันดอก”" },
  xiahou_dun: { name: "แฮหัวตุ้น", desc: "<strong>1. ย้อนรอยศัตรู</strong> เมื่อคุณได้รับความเสียหาย คุณสามารถเปิดการ์ดตัดสินได้ <br />- ถ้าเป็น (<span class='red'>❤</span>) จะไม่มีอะไรเกิดขึ้น <br />- ถ้าไม่ไช่ ผู้ที่สร้างความเสียหายจะต้องเลือก ว่าจะได้รับความเสียหาย 1 หน่วย หรือจะทิ้งการ์ดบนมือ 2 ใบ" },
  lady_zhen: { name: "เอียนสี", desc: "<strong>1. สาวงามล่มเมือง</strong> คุณสามารถใช้การ์ดสีดำ (♣️/♠️) ในมือแทนการ์ด “หลบหลีก” ได้ <br /> <strong>2. พึ่งวาสนา</strong> ในขั้นตอนเตรียมการ คุณสามารถเลือกเปิดการ์ดตัดสินได้ หากเปิดออกมาเป็นการ์ดสีดำ (♣️/♠️) คุณสามารถเก็บไว้ได้ (สามารถใช้ได้เรื่อยๆจนกว่าจะเปิดได้การ์ดสีแดง)" },

  huang_yueying: { name: "หวงเย่อิง", desc: "<strong>1. คลังปัญญา</strong> เมื่อคุณใช้การ์ดอุบายธรรมดา คุณสามารถจั่วการ์ดได้ 1 ใบ <br /> <strong>2. ผู้วิเศษ</strong> ทักษะติดตัว : คุณสามารถใช้การ์ดอุบายได้โดยไม่จำกัดระยะทาง <br /><strong>3. หลักแหลม</strong> เมื่อคุณตกเป็นเป้าของการ์ดอุบายรอเวลา คุณได้จั่วการ์ด 1 ใบ <br />" },
  guan_yu: { name: "กวนอู", desc: "<strong>1. เทพสงคราม</strong> คุณสามารถใช้การ์ดสีแดง (<span class='red'>❤</span>/<span class='red'>◆</span>) เป็นการ์ด “โจมตี” แทนได้ (สามารถใช้การ์ดอุปกรณ์ที่ติดตั้งแล้วแทนได้) <br /> <strong>2. สับเปลี่ยนศาตราวุธ</strong> หยิบการ์ดอุปกรณ์ที่ติดตั้งแล้วบนพื้นที่ตัวเองขึ้นมือได้" },
  liu_bie: { name: "เล่าปี่", desc: "<strong>1.	เมตตาธรรม</strong> ในขั้นตอนการเล่นการ์ด คุณสามารถมอบการ์ดในมือให้กับผู้เล่นคนอื่นได้ หากคุณมอบการ์ดตั้งแต่ 2 ใบขึ้นไปในรอบนี้ ฟื้นฟู พลังชีวิตของคุณ 1 หน่วย  <br /> <strong>2. คุณธรรมนำประชา</strong> ทักษะจักรพรรดิ : เมื่อคุณต้องการใช้การ์ด “โจมตี” คุณสามารถขอให้ขุนพลจ๊กก๊กใช้การ์ด “โจมตี” แทนคุณได้ (ขุนพลคนนั้นเลือกได้ว่าจะใช้หรือไม่ใช้)" },
  zhuge_liang: { name: "จูกัดเหลียง", desc: "<strong>1. หยั่งรู้ฟ้าดิน</strong> ในขั้นตอนการจั่วการ์ด คุณสามารถจั่วการ์ดได้ 4 ใบ เก็บไว้เอง 2 ใบ และต้องเลือกที่จะทิ้งหรือมอบการ์ดที่เหลืออีก 2 ใบ ให้ขุนพลคนถัดไป หากเลือกมอบ ขุนพลคนนั้นจะไม่ได้จั่วการ์ดปกติในรอบของเขา (หากเหลือผู้เล่นแค่ 2 คน ต้องเลือกทิ้งการ์ดเท่านั้น) <br /> <strong>2. กลยุทธ์เมืองว่าง</strong> ทักษะติดตัว : หากคุณไม่มีการ์ดในมือ คุณจะไม่สามารถตกเป็นเป้าหมายของการ์ด “โจมตี” หรือการ์ด “ท้าสู้” ได้" },
  zhang_fei: { name: "เตียวหุย", desc: "<strong>1. คำราม</strong> สามารถใช้การ์ด “โจมตี” ได้โดยไม่จำกัดจำนวนครั้ง <br /> <strong>2. ร่วมสาบาน</strong> เมื่อคุณใช้การ์ด “สุรา” เพื่อเพิ่มพลังโจมตี คุณสามารถทิ้งการ์ด 1 ใบ เพื่อฟื้นฟูพลังชีวิต 1 หน่วย" },
  ma_chao: { name: "ม้าเฉียว", desc: "<strong>1. ทหารม้า</strong> ทักษะติดตัว : ระยะทางในการใช้การ์ดของคุณกับขุนพลคนอื่นจะ -1 หน่วย (สามารถติดตั้งการ์ดพาหนะได้ตามปกติ) <br /> <strong>2. ม้าคะนองศึก</strong> เมื่อคุณใช้การ์ด “โจมตี” ให้เปิดการ์ดตัดสิน 1 ใบถ้าการ์ดที่เปิดเป็นสีแดง (<span class='red'>❤</span>/<span class='red'>◆</span>) ถือว่าการโจมตีสำเร็จ" },
  zhao_yun: { name: "จูล่ง", desc: "<strong>1. วีรบุรุษเนินเตียงปัน</strong> คุณสามารถเลือกใช้การ์ด “โจมตี” แทนการ์ด “หลบหลีก” และใช้การ์ด “หลบหลีก” แทนการ์ด “โจมตี” ได้ <br /> <strong>2. สุภาพบุรุษแห่งเสียงสาน</strong> หากได้เปิดการ์ดตัดสิน แล้วการ์ดนั้นคือการ์ด “หลบหลีก” คุณจะได้รับการ์ดนั้น" },
  
  cai_wenji: { name: "ไช่ เหวินจี", desc: "<strong>1. บทเพลงแสนเศร้า </strong> เมื่อมีขุนพลได้รับความเสียหายจากการ์ด “โจมตี” คุณสามารถทิ้งการ์ด 1 ใบ เพื่อให้ขุนพลนั้นจั่วการ์ดตัดสินและได้รับผลดังนี้ : <br />- <span class='red'>❤</span> : ฟื้นฟูพลังชีวิต 1 หน่วย <br />- <span class='red'>◆</span> : จั่วการ์ด 3 ใบ <br />-	♣️ : จั่วการ์ด 1 ใบ และขุนพลที่สร้างความเสียหายทิ้งการ์ดบนมือ 1 ใบ <br />- ♠️ : เลือกทิ้งการ์ด 1 ใบบนพื่นที่ติดตั้งอุปกรณ์ หรือขุนพลที่สร้างความเสียหายทิ้งการ์ดบนมือ 2 ใบ <br /><strong>2. ใจสลาย</strong> ทักษะติดตัว : เมื่อคุณตาย ขุนพลที่ฆ่าคุณจะต้องเลือกทิ้งการ์ด 2 ใบ และจบรอบการเล่นทันที" },
  zuo_ci: { name: "โจจู๋", desc: "<strong>1. แปลงกาย </strong> เมื่อเริ่มเกม คุณจะสุ่มได้รับร่างปลอมขุนพลอื่น 2 คน สำหรับทักษะ “แปลงกาย” เลือกขุนพล 1 คน เพื่อ “แปลงกาย” โดยที่เพศและก๊กของคุณจะเป็นไปตามการ์ดขุนพลที่เปิด เมื่อเริ่มต้นรอบหรือจบรอบ เลือกได้ 1 อย่าง : <br /> - “แปลงกราย” เป็นขุนพลอื่น<br /> - “สุ่มร่างปลอม” สุ่มทิ้งและได้รับร่างปลอมขุนพลอื่น 1 คน<br /> <strong>2. ความแตก </strong> เมื่อคุณได้รับความเสียหาย หลังจากจบรอบของคุณ คุณต้องใช้ทักษะ “สุ่มร่างปลอม”" },
  yuan_shu_king: { name: "อ้วนสุด ราชาแห่งจงค์", desc: "<strong>1. กำเริบเสิบสาน </strong>ทักษะติดตัว : ในขั้นตอนการจั่วการ์ด ต้องจั่วการ์ดตามจำนวนอาณาจักรที่มีขุนพลมีชีวิตอยู่ จากนั้นในขั้นตอนการสิ้นสุดรอบ หากคุณ : <br />-	ไม่ได้สร้างความเสียหาย : จั่วการ์ด 2 ใบ <br />-	สร้างความเสียหาย : จำนวนการ์ดสูงสุดบนมือเพิ่มขึ้น 1 ใบ <br /><strong>2. จักรพรรดิจอมปลอม </strong>ทักษะจักรพรรดิ : สำหรับการ์ดที่ทิ้งในขั้นตอนการทิ้งการ์ด คุณส่งให้ขุนพลอิสระอื่นได้ 1 ใบ" },
  zhang_jiao: { name: "เตียวก๊ก", desc: "<strong>1. สายฟ้าฟาด </strong> เมื่อใช้การ์ด “หลบ” สามารถให้ขุนพลอื่นจั่วการ์ดตัดสิน<br />- ♠️ ขุนพลเป้าหมายได้รับความเสียหาย 1 หน่วย คุณได้จั่วการ์ด 1 ใบ<br />- ♣️ คุณฟื้นฟูพลังชีวิต 1 หน่วย ทิ้งการ์ดบนมือของขุนพลเป้าหมาย 1 ใบ <br /> <strong>2. ผู้คุมสายฟ้า</strong> เมื่อมีขุนพลกำลังจะจั่วการ์ดตัดสิน (ยกเว้น “กลยุทธ์ลูกโซ่”) คุณสามารถใช้การ์ดสีดำ 1 ใบ ในมือแทนการ์ดตัดสินนั้นได้<br /><strong>3. อิทธิฤทธิ์ฟ้าดิน</strong> ทักษะจักรพรรดิ : ในรอบขุนพลอิสระคนอื่น ขุนพลนั้นสามารถมอบการ์ด “หลบ” หรือ “ฟ้าลงโทษ” ให้คุณได้" },
  tao_yin: { name: "เต๋าหยิน อิเกียด", desc: "<strong>1. สะกดจิต</strong> ในรอบการเล่นของคุณหรือขุนพลอื่น คุณสามารถหมอบการ์ดสะกดจิต 1 ใบ และประกาศชื่อการ์ดที่คุณต้องการใช้ (ยกเว้นการ์ดอุบายรอเวลา) จากนั้นถามขุนพลอื่นตามลำดับ หากมีคนไม่เชื่อให้เปิดการ์ดทันที (ใช้ได้รอบละ 2 ครั้ง) <br /> - หากการ์ดเป็นเท็จ การ์ดใบนั้นจะไม่แสดงผล <br /> - หากการ์ดเป็นจริง การ์ดจะแสดงผลทันที และขุนพลที่ไม่เชื่อจะติดสถานะ “ถูกสะกดจิต” ขุนพลนั้นจะเชื่อทักษะ “สะกดจิต” เสมอ และถ้าพลังชีวิตเหลือ 1 หน่วยจะไม่สามารถใช้ทักษะขุนพลได้ (ยกเว้นทักษะติดตัว)" },
  pang_de: { name: "บังเต๊ก", desc: "<strong>1. ทหารม้า</strong> ทักษะติดตัว : ระยะทางในการใช้การ์ดของคุณกับขุนพลคนอื่นจะ -1 หน่วย <br /> <strong>2. ออกศึก</strong> เมื่อเลือกขุนพลเป้าหมายของการ์ด “โจมตี” คุณทิ้งการ์ด 1 ใบ จากมือเป้าหมาย <br /> - ถ้าการ์ดที่ถูกทิ้งเป็นการ์ดอุปกรณ์หรือการ์ด “หลบ” ขุนพลนั้นจะไม่สามารถใช้การ์ด “หลบ” ได้  <br /> - ถ้าไม่ใช่ขุนพลนั้นจะได้รับการ์ด “โจมตี” ของคุณ" },
  dong_zhou: { name: "ตั๋งโต๊ะ", desc: "<strong>1. อสูรสุรา </strong>คุณสามารถใช้การ์ด (♠️) ในมือแทนการ์ด “สุรา” ได้ (ใช้ได้รอบละ 1 ครั้ง) <br /><strong>2. เคล้านารี </strong>ทักษะติดตัว : ถ้าคุณใช้การ์ด “โจมตี” กับขุนพลหญิงหรือขุนพลหญิงใช้การ์ด “โจมตี” กับคุณ จะต้องใช้การ์ด “หลบ” 2 ใบ <br /><strong>3. ถูกโค่นล้ม </strong>ทักษะติดตัว : ในขั้นตอนการสิ้นสุดรอบ หากคุณไม่ใช่ขุนพลที่มีพลังชีวิตน้อยสุด (<=) ต้องจั่วการ์ดตัดสิน หากไม่ได้ (♠️) เสียพลังชีวิต 1 หน่วย <br /><strong>4. เหี้ยมโหด </strong>ทักษะจักรพรรดิ : เมื่อขุนพลอิสระคนอื่นสร้างความเสียหาย 1 หน่วย ขุนพลนั้นจะสามารถจั่วการ์ดตัดสิน ถ้าผลเป็น (♠️) คุณฟื้นฟูพลังชีวิต 1 หน่วย " },
  jia_xu: { name: "กาเซี่ยง", desc: "<strong>1.	สังหารเกลี้ยง</strong> ทักษะติดตัว : ในรอบของคุณ ขุนพลอื่นไม่สามารถใช้การ์ด “เสบียง” ได้ <br /><strong>2.	กุนซือปีศาจ</strong> ทักษะติดตัว : คุณจะไม่ตกเป็นเป้าหมายของการ์ดอุบายสัญลักษณ์ (♣)<br /><strong>3.	กลยุทธ์ปีศาจ</strong> หากพลังชึวิตของคุณไม่เต็ม คุณสามารถบังคับให้ขุนพลอื่นทุกคนเลือกระหว่างใช้การ์ด “โจมตี” กับขุนพลอื่นที่อยู่ในระยะทาง 1 หน่วย (ยกเว้นคุณ) หรือทิ้งการ์ดบนมือ 2 ใบ หรือเสียพลังชีวิต 1 หน่วย (ใช้ได้ครั้งเดียวในเกม)" },

  zhang_zhao: { name: "เตียวเจียว", desc: "<strong>1. ที่ปรึกษาอาวุโส</strong> คุณสามารถติดตั้งการ์ดอุปกรณ์ในมือ 1 ใบ ให้ขุนพลอื่นและคุณได้จั่วการ์ด 1 ใบ <br /><strong>2. กลยุทธ์เสริมแกร่ง</strong> หากคุณใช้ความสามารถของอุปกรณ์ในรอบของคุณ คุณจะได้จั่วการ์ด 1 ใบ<br /> <strong>3. ธรรมาภิบาล </strong> เมื่อสิ้นสุดรอบของขุนพลอื่น คุณสามารถหยิบการ์ดทั้งหมดที่ขุนพลนั้นทิ้งไปได้ แต่ต้องคืนการ์ด 1 ใบให้ขุนพลเจ้าของรอบ" },
  lu_kang: { name: "ลกข้อง", desc: "<strong>1. ถ่อมตัว</strong> ทักษะติดตัว : คุณไม่สามารถตกเป็นเป้าของการ์ดอุบายรอเวลาหรือ “ท้าสู้” หรือ “กลยุทธ์ลูกโซ่” <br /><strong>2. ประหารชีวิต </strong> คุณสามารถยกเลิกผลของพื้นที่ติดตั้งของคุณถาวร 1 พื้นที่ เพื่อได้รับทักษะในรอบนี้ <br />- พื้นที่อาวุธ : ใช้การ์ด “โจมตี” เพิ่มได้ 1 ครั้ง <br />- พื้นที่เกราะ : จั่วการ์ด 3 ใบ ขีดจำกัดการ์ดบนมือสูงสุดเพิ่มขึ้น 3 <br />- พื้นที่พาหนะ : ลดระยะห่างระหว่างคุณกับขุนพลอื่น 3 หน่วย <br />- พื้นที่สมบัติ(วัว) : ขุนพลอื่น 1 คนต้องแสดงการ์ดบนมือทั้งหมด <br /><strong>3. เสื่อมอำนาจ </strong>ทักษะปลุกพลัง : เมื่อคุณสูญเสียพื้นที่ติดตั้งอุปกรณ์จนหมด คุณจะสามารถทิ้งการ์ดอุปกรณ์บนมือเพื่อ “จั่วใหม่”" },
  taishi_ci: { name: "ไทสูจู้", desc: "<strong>1. ทัณฑ์สวรรค์</strong> คุณสามารถ “ท้าสู้แต้ม” กับขุนพลอื่น <br /> - หากคุณชนะ จั่วการ์ด 1 ใบ คุณสามารถใช้การ์ด “โจมตี” ได้อีก 1 ครั้ง และสามารถเลือกเป้าหมายของการ์ด “โจมตี” เพิ่มได้อีก 1 คน <br /> - หากคุณแพ้ รอบนี้คุณใช้การ์ด “โจมตี” ไม่ได้อีก (ใช้ได้รอบละ 1 ครั้ง)" },
  sun_jian: { name: "ซุนเกี๋ยน", desc: "<strong>1. จิตวิญญาณวีรบุรุษ</strong> ขั้นตอนการเล่นการ์ด ถ้าพลังชีวิตของคุณไม่เต็ม สามารถเลือกให้ขุนพลอื่นทำ 1 อย่าง <br />-	จั่วการ์ด 1 ใบ <br />- จั่วการ์ด 2 ใบ จากนั้นทิ้งการ์ด 2 ใบ <br /><strong>2. ฆ่าล้างเผ่าพันธุ์ </strong> เมื่อมีขุนพลอื่นตาย หลังจากจบรอบของขุนพลนั้น คุณได้จั่วการ์ด 2 ใบ (ทุกๆครั้งที่คุณใช้ทักษะนี้ จั่วการ์ดเพิ่มขึ้น 1 ใบ)" },

  xiahou_yuan: { name: "แฮหัวเอี๋ยน", desc: "<strong>1.	เร็วดุจเทพ </strong> ในรอบของคุณ คุณสามารถทิ้งการ์ด 1 ใบและ ข้ามขั้นตอนบางอย่างแทนการใช้การ์ด “โจมตี” โดยไม่จำกัดระยะทางได้ (ใช้ได้รอบละ 1 ครั้ง) <br /> - การเปิดการ์ดตัดสินและการจั่วการ์ด <br /> - การเล่นการ์ด <br /> - การทิ้งการ์ด <br /><strong>2. สายสัมพันธ์พี่น้อง </strong> หากแฮหัวตุ้นอยู่ในสนาม คุณและขุนพลเป้าหมายสามารถทิ้งการ์ดบนมือแทนกันได้" },
  cao_ren: { name: "โจหยิน", desc: "<strong>1. บุก!! </strong> ขั้นตอนการสิ้นสุดรอบ จั่วการ์ด 4 ใบ จากนั้นเลือกติดตั้งการ์ดอุปกรณ์ หรือ ทิ้งการ์ด 1 ใบ (ใช้ได้ครั้งเดียวในเกม) <br /> <strong>2.	ยุทโธปกรณ์ชั้นเลิศ </strong> สามารถใช้การ์ดอุปกรณ์ที่ติดตั้งแล้วแทน “คงกระพันชาตรี” ได้ <br /> <strong>3. สับเปลี่ยนยุทโธปกรณ์ </strong> คุณสามารถทิ้งการ์ดบนมือได้ 1 ใบ เพื่อย้ายการ์ดอุปกรณ์บนสนาม 1 ใบ (ใช้ได้ครั้งเดียวในเกม)" },
  dian_wei: { name: "เตียนอุย", desc: "<strong>1. ชั่วแต่กำเนิด </strong> ในขั้นตอนการเล่นการ์ด คุณเลือก 1 อย่าง (ใช้ได้รอบละ 1 ครั้ง) <br /> - เสียพลังชีวิต 1 หน่วย <br /> - ทิ้งการ์ดบนมือ 1 ใบ <br /> เลือกขุนพลอื่นคนในระยะโจมตี ให้ขุนพลคนนั้นเลือกมา 1 สัญลักษณ์ (<span class='red'>❤</span>/<span class='red'>◆</span>/♣️/♠️) และสุ่มหยิบการ์ดบนมือคุณ 1 ใบ <br /> - ถ้าทายผิดต้องเสียพลังชีวิต 1 หน่วย <br /> <strong>2. สู้จนตัวตาย </strong> หากได้รับความเสียหายในรอบของตัวเอง คุณสามารถใช้ “ชั่วแต่กำเนิด” ได้อีก 1 ครั้ง (ใช้ซ้ำกับขุนพลเดิมไม่ได้)" },
  deng_ai: { name: "เตงหงาย", desc: "<strong>1. ชาวนาผู้ทรนง </strong> เมื่อคุณใช้หรือสูญเสียการ์ดนอกรอบการเล่นของคุณ สามารถจั่วการ์ดตัดสิน <br /> - ถ้าเป็น (<span class='red'>❤</span>) จะได้รับการ์ดตัดสินนั้น <br /> - หากไม่ใช่คุณจะได้รับสถานะ “ไร่นา” (ระยะทางระหว่างคุณกับขุนพลอื่นจะเพิ่มขึ้นตามจำนวน “ไร่นา”)<br /><strong>2. ยากจน </strong> ทักษะปลุกพลัง : หากจำนวนของ “ไร่นา” มากกว่า 2 หน่วย จะได้รับทักษะ “ขโมยแกะ” (คุณใช้ “ไร่นา” แทนการ์ด “ขโมยแกะ” ได้) <br />- ทุกๆขั้นตอนการสิ้นสุดรอบ จำนวน “ไร่นา” จะลดลงครึ่งนึงเสมอ (เศษปัดลง)" },
  hao_zhao: { name: "เฮกเจียว", desc: "<strong>1. ป้อมปราการ </strong> ในขั้นตอนการสิ้นสุดรอบ คุณเลือกขุนพลอื่น 1 คน ขุนพลคนนั้นจะต้องจั่วการ์ดหรือทิ้งการ์ด จนกระทั่งมีการ์ดเท่ากับการ์ดบนมือคุณ และในรอบของขุนพลคนนั้นเมื่อเขาจบรอบ ก็ให้ทำเหมือนเดิมอีก" },
  zhang_he: { name: "เตียวคับ", desc: "<strong>1. พลิกแพลง </strong> คุณสามารถทิ้งการ์ดในมือ 1 ใบ เพื่อข้ามขั้นตอนใดขั้นตอนหนึ่ง เพื่อได้รับผลต่อไปนี้ : <br /> - ข้ามขั้นตอนการจั่วการ์ด : เลือกขุนพล 2 คน หยิบการ์ดบนมือคนละ 1 ใบ <br /> - ข้ามขั้นตอนการเล่นการ์ด : คุณสามารถย้ายการ์ด 1 ใบ บนพื่นที่ติดตั้งอุปกรณ์บนสนาม (ไม่สามารถเอามาเป็นของตัวเองได้)" },
  xu_huang: { name: "ซิหลง", desc: "<strong>1. ตัดเสบียง </strong> ในขั้นตอนการเล่นการ์ด คุณสามารถใช้การ์ดสัญลักษณ์สีดำ (♣️/♠️) (การ์ดพื้นฐาน/การ์ดอุปกรณ์) แทนการ์ด “ตัดเสบียง” ได้ (ใช้กับขุนพลที่มีการ์ดบนมือน้อยคุณกว่าไม่ได้) ในระยะ 1 หน่วย <br/> <strong>2. ตุนเสบียง </strong> หลังจากใช้การ์ด “เสบียง” กับตัวเอง หากพลังชีวิตไม่เต็ม ได้จั่วการ์ด 1 ใบ <br/> <strong>2. ตัดกำลังพล </strong> ทักษะติดตัว : เมื่อขุนพลอื่นข้ามขั้นตอนการจั่วการ์ด คุณได้จั่วการ์ด 1 ใบ" },
  xun_yu: { name: "ซุนฮก", desc: "<strong>1. กระตุกหนวดเสือ </strong> คุณสามารถ “ท้าสู้แต้ม” กับขุนพลที่มีพลังชีวิตมากกว่าคุณได้ (ใช้ได้รอบละ 1 ครั้ง) <br /> - ถ้าชนะ ขุนพลเป้าหมายทำความเสียหาย 1 หน่วย แก่ขุนพลอื่นที่อยู่ในระยะการโจมตี <br /> - ถ้าแพ้ คุณได้รับความเสียหาย 1 หน่วย <br/> <strong>2. ต่อชีวิต </strong> เมื่อคุณได้รับความเสียหาย คุณจั่วการ์ด 2 ใบ เมอบการ์ด 1 ใบ ให้ขุนพลอื่น" },

  meng_huo: { name: "เบ้งเฮ็ก", desc: "<strong>1. ราชาคนเถื่อน </strong> ทักษะติดตัว : การ์ด “คนเถื่อนบุกรุก” ไม่มีผลกับคุณ เมื่อขุนพลอื่นใช้การ์ด “คนเถื่อนบุกรุก” คุณจะกลายเป็นผู้ใช้การ์ดแทน <br/> <strong>2. พักรบ </strong> ในขั้นตอนการทิ้งการ์ดคุณจะได้รับผลตามนี้ <br />- หากทิ้งการ์ดสัญลักษณ์ (<span class='red'>❤</span>) คุณฟื้นฟูพลังชีวิต 1 หน่วย (สูงสุด 1) <br />- หากทิ้งการ์ดสีดำ (♣️/♠️) เลือกขุนพลใดก็ได้ จั่วการ์ด 1 ใบ (สูงสุด 3)" },
  zhu_rong: { name: "จกหยง ฮูหยิน", desc: "<strong>1. องค์หญิงผู้ป่าเถื่อน </strong> ทักษะติดตัว : การ์ด “คนเถื่อนบุกรุก” ไม่มีผลกับคุณ เมื่อคุณพลอื่นใช้การ์ด “คนเถื่อนบุกรุก” คุณจะได้รับการ์ดนั้น <br/> <strong>2. ท้าชน </strong> หลังจากที่คุณเลือกเป้าหมาย การ์ด “โจมตี” คุณสามารถ “ท้าสู้แต้ม” กับขุนพลเป้าหมายได้ <br /> - ถ้าชนะ คุณจะได้การ์ด “ท้าสู้แต้ม” ของเป้าหมาย <br /> - ถ้าแพ้ ต่างฝ่ายต่างหยิบการ์ด “ท้าสู้แต้ม” ของตัวเองกลับไป" },
  wei_yan: { name: "อุยเอี๋ยน", desc: "<strong>1.	บ้าคลั่ง </strong> หลังจากที่คุณสร้างความเสียหายจากการ์ด “โจมตี” ให้แก่ขุนพลที่มีระยะทาง 1 หน่วย คุณเลือกฟื้นฟูพลังชีวิต 1 หน่วย หรือจั่วการ์ด 1 ใบ<br /><strong>2.	แผนก่อกบฏ </strong> ลดพลังชีวิตลงเหลือ 1 หน่วย เลือกขุนพลเป้าหมายเพื่อลดระยะทางกับขุนพลเป้าหมายเหลือ 0 หน่วย และสามารถใช้การ์ด “โจมตี” ได้ตามจำนวนเลือดที่ลดลงจากทักษะนี้ (ใช้ได้ครั้งเดียวในเกม)" },
  zhuge_liang_prime: { name: "จูกัดเหลียง มังกรนิทรา", desc: "<strong>1. ค่ายกลแปดทิศ</strong> หากคุณไม่ได้ติดตั้งการ์ดอาวุธและเกราะป้องกัน จะถือว่าคุณได้ติดตั้ง “ค่ายกลแปดทิศ” <br/> <strong>2. อุบายไฟ </strong> หากโจมตีศัตรูด้วยการ์ด “โจมตี” สีแดง (<span class='red'>❤</span>/<span class='red'>◆</span>) สำเร็จ ผลของการ์ด “กลยุทธ์ลูกโซ่” จะทำงานโดยไม่ต้องจั่วการ์ดตัดสิน <br/> <strong>3. มังกรนิทรา </strong> สามารถใช้การ์ดสีดำ (♣️/♠️) แทนการ์ด “คงกระพันชาตรี”" },

  lubu_god: { name: "ลิโป้ เทพสงคราม", desc: "<strong>1. โทสะ</strong> เมื่อเริ่มเกมส์คุณจะได้สถานะ “เกรี้ยวกราด” 3 หน่วย ทุกครั้งที่คุณได้รับหรือสร้างความเสียหาย คุณจะได้รับสถานะ “เกรี้ยวกราด” <br /><strong>2. ไร้ซึ่งแผนการณ์</strong> เมื่อคุณใช้การ์ดอุบายพื้นฐานยกเว้น “ท้าสู้” คุณต้องเลือกเสียพลังชีวิตหรือเสีย “เกรี้ยวกราด” 1 หน่วย <br /><strong>3. หนึ่งในใต้หล้า</strong> ใช้ “เกรี้ยวกราด” 2 หน่วย หากคุณใช้การ์ด “โจมตี” คู่ต่อสู้ต้องใช้การ์ด “หลบหลีก” 2 ใบ เพื่อหักล้าง และในการ “ท้าสู้” คู่ต่อสู้ต้องใช้การ์ด “โจมตี” 2 ใบ ในการต่อสู้กับคุณ <br /> <strong>4. เกินต้านทาน</strong> ใช้ “เกรี้ยวกราด” 2 หน่วย เมื่อใช้การ์ด “โจมตี” เกราะของขุนพลนั้นจะไม่แสดงผล หากเป้าหมายใช้การ์ด “หลบ” คุณจะได้ “เกรี้ยวกราด” คืน 1 หน่วย <br /> <strong>5. เทพแห่งสงคราม</strong> ใช้ “เกรี้ยวกราด” 6 หน่วย ขุนพลอื่นทุกคนด้วยเสียพลังชีวิต 1 หน่วย ทิ้งการ์ดชุดเกราะและพาหนะที่ติดตั้งอยู่ ทิ้งการ์ดบนมือ 2 ใบ หลังจากนั้นคุณไม่สามารถใช้ทักษะขุนพลได้อีกตลอดทั้งเกมส์ <br />" },
  guan_yu_god: { name: "กวนอู เทพแห่งความซื่อสัตย์", desc: "<strong>1. เทพเจ้าแห่งการรบ</strong> คุณสามารถใช้การ์ด (<span class='red'>❤</span>) บนมือแทนการ์ด “โจมตี” ได้ไม่จำกัดระยะทาง <br /> <strong>2. วิญญานเทพยุทธ์</strong> ทักษะติดตัว : เมื่อได้รับความเสียหายจะได้รับสถานะ “ฝันร้าย” 1 หน่วย คุณสามารถใช้สถานะ“ฝันร้าย” 2 หน่วย แทนการใช้การ์ด (<span class='red'>❤</span>) ได้ <br /> <strong>2. ล้างแค้น</strong> ทักษะติดตัว : หากคุณตายเลือก 1 อย่าง <br /> - ใช้ “ฝันร้าย” ทั้งหมด ฟื่นฟูพลังชีวิต 1 หน่วย <br /> - เลือกขุนพลอื่นตามจำนวน “ฝันร้าย” ที่มีเป็นเป้าหมาย ขุนพลต้องจั่วการ์ดตัดสิน หากได้การ์ด “เสบียง” หรือ “ร่วมสาบาน” ต้องทิ้งการ์ดบนมือทั้งหมด หากไม่ใช่จะได้ความเสียหาย 1 หน่วยแทน" },
  cao_cao_god: { name: "โจโฉ สมมติเทพ", desc: "<strong>1. เงาบิน</strong> ทักษะติดตัว : ระยะทางระหว่างขุนพลอื่นเพิ่มขึ้น +1 หน่วย <br /><strong>2. ถวายบรรณาการ</strong> เมื่อคุณได้รับความเสียหาย สามารถเลือกได้รับการ์ด 1 ใบ จากพื้นที่ ของขุนพลอื่นทุกคนตามลำดับ (ใช้ได้ครั้งเดียวในเกมส์)<br /> <strong>3. ยุติสงคราม</strong> ขุนพลอื่นสามารถใช้การ์ด “โจมตี” กับคุณได้แค่ครั้งเดียวในรอบของเขา" },
  zhou_yu_god: { name: "จิวยี่ ผู้ถ่มน้ำลายรดฟ้า", desc: "<strong>1. ดีดพิณ</strong> ทักษะติดตัว: คุณสามารถใช้ทักษะขุนพลนอกรอบการเล่นได้ <br />- คุณต้องมีการ์ดบนมืออย่างน้อย 1 ใบบนมือเพื่อใช้ทักษะ <br />- ทุกๆครั้งที่คุณใช้ทักษะขุนพลคุณได้จั่วการ์ด 2 ใบ <br />- สามารถใช้อุปกรณ์ที่ติดตั้งบนพื้นที่ของคุณ หรือการ์ดกองกลางร่วมกับทักษะขุนพลได้<br /><strong>2. คู่บัลลังค์</strong> <strong>1. คู่</strong> หากมีการ์ดเลขซ้ำ 2 คู่ ทิ้งการ์ดเหล่านั้น สร้างความเสียหาย 1 หน่วยแก่ขุนพล 1 คน<br /><strong>3. บรรเลงกู่ฉิน</strong> หากคุณมีการ์ดสัญลักษณ์เดียวกัน 4 ใบ ทิ้งการ์ดเหล่านั้น ทิ้งการ์ด 2 ใบ จากพื้นที่ขุนพล 1 คน<br /><strong>4. เสือสำอาง</strong> หากมีการ์ดเลขเรียง 4 ใบ ทิ้งการ์ดเหล่านั้น หยิบการ์ด 2 ใบ จากพื้นที่ขุนพล 1 คน<br /><strong>5. ถ่มน้ำลายรดฟ้า</strong> หากมีการ์ดเลขซ้ำ 3 ใบ ทิ้งการ์ดเหล่านั้น คุณจั่วการ์ด 3 ใบ ขุนพลอื่นจั่วการ์ด 1 ใบ"},
  zhang_liao_god: { name: "เตียวเลี้ยว เทพสายฟ้า", desc: "<strong>1. เลียนแบบ</strong> เมื่อคุณสร้างความเสียหายให้ขุนพลอื่น คุณสามารถยกเลิกพื้นที่ของคุณ 1 พื้นที่ เพื่อเลียนแบบทักษะของขุนพลเป้าหมาย (ยกเว้น ทักษะปลุกพลัง, ทักษะที่ใช้ได้ครั้งเดียวในเกมส์) หากขุนพลนั้นตาย ทักษะเลียนแบบจะหายไปด้วย และคุณจะได้พื้นที่อุปกรณ์คืน 1 พื้นที่ <br /><strong>2. ฮึกเหิม</strong> ทักษะติดตัว : ขุนพลใดที่เคยได้รับความเสียหายจากคุณ จะมีจำนวนการ์ดบนมือสูงสุด -1 ไปจนกว่าขุนพลนั้นจะสามารถสร้างความเสียหายคืนใส่คุณได้" },

  sun_ce: { name: "ซุนเซ็ก", desc: "<strong>1. จอมโทสะ </strong>เมื่อคุณใช้หรือเป็นเป้าหมายของการ์ด “โจมตี” หรือ “ท้าสู้” ที่มีสัญลักษณ์สีแดง คุณจั่วการ์ด 1 ใบ <br /><strong>2. พยัคฆ์ร้ายแห่งเตียงสา</strong> ทักษะปลุกพลัง : ขั้นตอนการเตรียมการ ถ้ามีพลังชีวิตไม่เกิน 2 หน่วย <br />- ในขั้นตอนการจั่วการ์ด จั่วการ์ดเพิ่มได้ 1 ใบ <br />- ในขั้นตอนการเล่นการ์ด เลือกหยิบการ์ด 1 ใบจากบนมือขุนพลอื่น หลังจากนั้น สามารถเลือกคืนการ์ดใบเดิม หรือทิ้งการ์ดและให้ขุนพลนั้นจั่วใหม่<br /><strong>3. ตั้งตนเป็นใหญ่ </strong>ทักษะจักรพรรดิ : ในขั้นตอนการเล่นการ์ดของขุนพลง่อก๊ก ขุนพลนั้นสามารถ “ท้าสู้แต้ม” กับคุณได้ หากคุณชนะ คุณจะได้รับการ์ดทั้งหมดที่ใช้ในการ “ท้าสู้แต้ม” ครั้งนี้ (ใช้ได้ 1 ครั้งต่อรอบ)" },
  liu_shan: { name: "เล่าเสี้ยน อาเต๋า", desc: "<strong>1. สุขสบาย </strong> ทักษะติดตัว : ขุนพลที่สร้างความเสียหายให้คุณทิ้งการ์ดบนมือ 1 ใบ <br /><strong>2. ไม่ทำอะไรเลย</strong> สามารถข้ามขั้นตอนการเล่นการ์ด ขีดจำกัดการถือการ์ดบนมือสูงสุดเป็น 4 ใบ และหลังจากสิ้นสุดรอบ คุณจั่วการ์ด 1 ใบ<br /><strong>3. โง่เขลา</strong> ทักษะจักรพรรดิ์, ทักษะปลุกพลัง : ในขั้นตอนการเตรียมการ หากคุณเป็นขุนพลที่มีพลังชีวิตน้อยที่สุด คุณสามารถขอให้ขุนพลจ๊กก๊กทิ้งการ์ด (<span class='red'>❤</span>) บนมือ 1 ใบ เพื่อฟื้นฟูพลังชีวิตของคุณ 1 หน่วย" },
  jiang_wei: { name: "เกียงอุย", desc: "<strong>1. ยั่วยุ</strong> ในขั้นตอนการเล่นการ์ด เลือกขุนพลอื่นให้ใช้การ์ด “โจมตี” กับคุณ หากทำไม่ได้จะต้องทิ้งการ์ด 1 ใบ (ใช้ได้รอบละ 1 ครั้ง) <br /><strong>2. ยึดมั่นอุดมการณ์</strong> ทักษะติดตัว : ทุกๆครั้งที่ขุนพลอื่นใช้การ์ด “โจมตี” กับคุณ หากขุนพลนั้นมีการ์ดบนมือมากกว่าคุณ คุณสามารถเลือกหยิบการ์ดจากบนมือขุนพลนั้น 1 ใบ หากไม่ใช่การ์ด “หลบหลีก” ให้ทิ้งการ์ดใบนั้น (ใช้ได้รอบละ 1 ครั้ง)" },
  lu_su: { name: "โลซก", desc: "<strong>1. โอบอ้อมอารี</strong> ในขั้นตอนการจั่วการ์ด คุณสามารถจั่วการ์ดเพิ่ม 2 ใบ ถ้าหากจั่วแล้วการ์ดในมือมีมากกว่า 5 ใบ คุณต้องให้การ์ดครึ่งหนึ่ง (ปัดเศษลง) กับขุนพลอื่นที่มีจำนวนการ์ดในมือน้อยที่สุด<br /><strong>2. สร้างสัมพันธมิตร</strong> สามารถเลือกขุนพลอื่น 2 คนที่มีการ์ดบนมือให้สลับการ์ดบนมือกัน และให้ขุนพลเลือกทิ้งการ์ดคนละ 1 ใบ หลังจากนั้นหากขุนพลไม่เหลือการ์ดบนมือ ขุนพลนั้นได้จั่วการ์ด 1 ใบ" },
  cao_pi: { name: "โจผี", desc: "<strong>1. คารวะด้วยจอกสุรา</strong> เมื่อขุนพลอื่นตาย คุณสามารถเลือกได้ 1 อย่าง : <br />- ได้รับการ์ดทั้งหมดของขุนพลนั้น <br />- ฟื้นฟูพลังชีวิต 1 หน่วย <br /><strong>1. เนรเทศ</strong> เมื่อคุณได้รับความเสียหาย ขุนพลอื่นเลือกทำ 1 อย่าง ดังนี้ : <br />- ทิ้งการ์ด 1 ใบบนมือ <br />- ทิ้งการ์ด 1 ใบบนพื้นที่ติดอุปกรณ์ <br />- เสียพลังชีวิต 1 หน่วย <br /><strong>3. อานุภาพบทกลอน</strong> ทักษะจักรพรรดิ : หากขุนพลวุยก๊กต้องเปิดการ์ดตัดสินสัญลักษณ์สีดำ ขุนพลนั้นสามารถให้คุณจั่วการ์ด 1 ใบ" },
  zhang_xiu: { name: "เตียวสิ้ว", desc: "<strong>1. ทัดทาน</strong> เมื่อคุณเป็นเป้าหมายการ์ดอุบายที่มีเป้าหมายมากกว่า 1 คน คุณสามารถส่งการ์ด 1 ใบ ให้ขุนพลอื่นได้ จากนั้นคุณจั่วการ์ด 1 ใบ หากการ์ดที่คุณให้เป็นการ์ดอุปกรณ์ คุณจะจั่วการ์ด 2 ใบ แทน<br /><strong>2. ไร้พ่ายในยามยุ่งเหยิง</strong> เมื่อคุณเป็นเป้าหมายของการ์ดอุบายรอเวลา คุณสามารถยกเลิกผลการ์ดบนพื้นที่ตัดสินและพื้นที่ติดอุปกรณ์ของคุณได้ในรอบนี้ จากนั้นเลือกขุนพลอื่น 1 คนในรอบนี้ขุนพลที่เลือกจะไม่สามารถใช้การ์ดจากมือได้ (ใช้ได้ครั้งเดียวในเกม)" },
  lady_wu: { name: "ชีฮูหยิน", desc: "<strong>1. การสมรสอันดี</strong> เมื่อมีขุนพลใดติดตั้งอุปกรณ์คุณสามารถให้ขุนพลอื่น ที่มีจำนวนการ์ดในมือมากกว่าคุณจั่วการ์ด 1 ใบ <br /><strong>2. สินสอด</strong> เมื่อมีขุนพลใดสูญเสียการ์ดบนพื้นที่ติดตั้งอุปกรณ์ เลือกขุนพลอื่นที่มีจำนวนการ์ดในมือน้อยกว่าคุณ ทิ้งการ์ด 1 ใบ<br /><strong>3. อ่อนหวาน </strong>ทักษะติดตัว : ขีดจำกัดการถือการ์ดบนมือสูงสุดของคุณ +1 <br /> <strong>4. อรชร</strong> ทักษะติดตัว : หากคุณได้รับความเสียหาย ขุนพลที่ทำความเสียหายให้คุณได้รับสถานะ “อ่อนแรง” 1 รอบ (ขีดจำกัดการถือการ์ดบนมือสูงสุด -1)" },
  zhou_tai: { name: "จิวท่าย", desc: "<strong>1. ไม่ยอมจำนน</strong> ทักษะติดตัว : คุณไม่สามารถติดตั้งเกราะหรือใช้การ์ด “หลบหลีก” หรือการ์ด “เสบียง” กับตัวเองได้ และเมื่อเข้าสู่สถานะใกล้ตายคุณได้รับสถานะ “บาดแผล” 1 หน่วย และจั่วการ์ดตัดสิน หากการ์ดตัดสินมีแต้มมากกว่าจำนวน “บาดแผล” ฟื้นฟูพลังชีวิต 1 หน่วย<br />- หากมี “บาดแผล” จำนวนการ์ดบนมือสูงสุดของคุณ +1 <br /><strong>2. เสียสละ</strong> ในขั้นต่อนการสิ้นสุดรอบของขุนพลอื่น คุณสามารถทิ้งการ์ด 2 ใบหรือลดพลังชีวิตตัวเอง 1 หน่วย เพื่อให้ขุนพลคนนั้นได้จั่วการ์ด 2 ใบ (ใช้ได้รอบละ 1 ครั้ง) <br /><strong>3. หลังชนฝา</strong> ในขั้นต่อนการเล่นการ์ด หากคุณมี “บาดแผล” คุณสามารถทิ้งการ์ด 1 ใบเพื่อเลือก 1 อย่าง <br />- จั่วการ์ด 1 ใบ <br />- ให้ขุนพลอื่นได้จั่วการ์ด 1 ใบ" },
  zhuge_zhan: { name: "จูกัดเจี๋ยม", desc: "<strong>1. ตัดสินใจพลาด</strong> ในขั้นตอนการสิ้นสุดรอบ และคุณจะได้จั่วการ์ดตามจำนวนเงื่อนไขที่คุณทำได้ในรอบนี้ <br />1.1 คุณสร้างความเสียหายภายในรอบนี้ได้ <br />1.2 คุณไม่ได้ทิ้งการ์ดภายในรอบนี้ได้ <br />1.3 จำนวนการ์ดบนมือของคุณน้อยที่สุดในสนาม <br />หากไม่ได้ทำตามเงื่อนเลย คุณและขุนพลอื่น 1 คน เสียพลังชีวิต 1 หน่วย <br /><strong>2. ตามรอยบิดา</strong> ทักษะติดตัว : ขุนพลที่มีการ์ดบนมือมากกว่าคุณไม่สามารถใช้การ์ด “ท้าสู้” และ “ไฟพิฆาต” กับคุณได้" },
  xiao_qiao: { name: "เสี่ยวเกี้ยว", desc: "<strong>1. กลิ่นหอมจากสวรรค์</strong> เมื่อคุณได้รับความเสียหาย จั่วการ์ดตัดสิน หากได้การ์ด (<span class='red'>❤</span>/<span class='red'>◆</span>) คุณสามารถทิ้งการ์ด (<span class='red'>❤</span>/♠️) จากบนมือเพื่อให้ขุนพลอื่นรับความเสียหายแทนคุณ (สูงสุด 1 หน่วย) และเลือกต่อไปนี้ 1 อย่าง<br />- ขุนพลนั้นจั่วการ์ด 1 ใบ <br />- ขุนพลนั้นจั่วการ์ดได้รับการ์ดที่คุณทิ้งไป<br /><strong>2. ยอดหญิงงาม</strong> ทักษะติดตัว : หลังจากที่คุณได้รับความเสียหาย คุณเลือกทิ้งการ์ดบนมือของขุนพลอื่น 1 ใบ (ยกเว้นขุนพลผู้ที่สร้างความเสียหาย)" },
  yuan_shao: { name: "อ้วนเสี้ยว", desc: "<strong>1. ศึกลวง</strong> สามารถใช้การ์ด 3 ใบ บนมือแทนการ์ด “เกาทัณฑ์พันดอก” <br />- ถ้าขุนพลอื่นใช้การ์ด “หลบหลีก” จากทักษะนี้คุณสามารถจั่วการ์ด 1 ใบต่อ 1 ขุนพลที่ใช้ <br />- ในรอบที่ใช้ทักษะนี้จะไม่สามารถใช้การ์ด “โจมตี” ได้ และไม่สามารถใช้ทักษะนี้ซ้ำในรอบเดียวกันได้ (ใช้ได้ 2 ครั้งในเกมส์)<br /><strong>2. กองกำลังอิสระ</strong> ทักษะจักรพรรดิ : จำนวนการ์ดบนมือสูงสุดของคุณ +1 ต่อทุกๆ ขุนพลอิสระที่ยังอยู่ในสนามรบ" },
  pang_tong: { name: "บังทอง", desc: "<strong>1. กลยุทธ์ลูกโซ่</strong> คุณสามารถใช้การ์ด (♣️) บนมือแทนการ์ด “กลยุทธ์ลูกโซ่” หรือ “จั่วใหม่” ได้ และคุณสามารถกำหนดเป้าหมายของ “กลยุทธ์ลูกโซ่” เพิ่มได้อีก 1 คน และหากขุนพลอื่นใช้ “กลยุทธ์ลูกโซ่” ขุนพลนั้นจะกลายเป็นเป้าหมายไปด้วย<br /><strong>2. นิพพาน</strong> เมื่อคุณอยู่ในสถานะใกล้ตาย คุณสามารถทิ้งการ์ดทั้งหมดบนมือและในพื้นที่ของคุณ จากนั้นจั่วการ์ด 5 ใบ เพิ่มพลังชีวิต 1 หน่วย (ใช้ได้ครั้งเดียวในเกม)" },
  yan_liang_and_wen_chou: { name: "งันเหลียง & บุนทิว", desc: "<strong>1. คู่ถึกท้าชน</strong> ในขั้นตอนการจั่วการ์ด ถ้าคุณเลือกจั่วการ์ดเพียง 1 ใบ ในรอบนี้คุณสามารถใช้การ์ดใดก็ได้ยกเว้น (<span class='red'>❤</span>) แทนการ์ด “ท้าสู้” <br /> ถ้าคุณแพ้ท้าสู้จากทักษะนี้คุณจะได้รับการ์ด “โจมตี” ที่ขุนพลอื่นใช้มาในการท้าสู้ครั้งนี้ (ใช้ได้รอบละ 2 ครั้ง)<br /><strong>2. คู่อึดอันตราย</strong> ทักษะปลุกพลัง : หากคุณพลังชีวิตเหลือ 1 คุณจะไม่ได้รับความเสียหายจากการ์ด “ท้าสู้”" },
  huang_zhong: { name: "ฮองตง", desc: "<strong>1. ศรพิฆาต</strong> หากคุณใช้การ์ด “โจมตี” ที่เป็นเลขคี่โจมตีศัตรู จะเกิดผลตามเงื่อนไขต่อไปนี้ <br />- หากคุณมีการ์ดในมือมากกว่าขุนพลเป้าหมาย ขุนพลเป้าหมายจะใช้การ์ด “หลบ” ไม่ได้ <br />- หากคุณมีพลังชีวิตน้อยกว่าหรือเท่ากับขุนพลเป้าหมาย เกราะของเป้าหมายจะไร้ผล <br /><strong>2. ซุ่มยิง</strong> หากคุณมี “ธนูกิเลน” บนพื้นที่ติดตั้งอุปกรณ์ คุณสามารถข้ามเงื่อนไขทุกอย่างของทักษะ “ศรพิฆาต” ได้ และสามารถใช้การ์ด “โจมตี” เลขคู่แทนได้" },
  guanqiu_jian: { name: "บู๊ขิวเขียม", desc: "<strong>1. ยกทัพจับศึก</strong> ในขั้นตอนการเล่นการ์ด เมื่อคุณใช้การ์ดเลขคู่กับขุนพลอื่น คุณได้รับสถานะ “เกียรติยศ” 1 หน่วย คุณสามารถใช้ “เกียรติยศ” เพื่อจั่วการ์ดได้ 1 ใบ<br /><strong>2. ส่งสาส์นเกียรติยศ</strong> ทักษะปลุกพลัง : ในขั้นตอนการเตรียมการ ถ้ามี “เกียรติยศ” มากกว่า 2 หน่วย และมีขุนพลอื่นพลังชีวิตเหลือ 1 หน่วย คุณจะได้จั่วการ์ดเท่ากับจำนวน “เกียรติยศ” ที่มี จากนั้นลดพลังชีวิตของคุณ 1 หน่วยและได้รับทักษะ “ไร้เกียรติ” (ใช้ได้ครั้งเดียวในเกมส์) <br /><strong>3. ไร้เกียรติ</strong> ทักษะปลุกพลัง : ในขั้นตอนการเล่นการ์ด คุณสามารถใช้ “เกียรติยศ” 1 หน่วย จากนั้นทิ้งการ์ด 1 ใบ บนสนาม" },
  chen_dao: { name: "ตันเตา", desc: "<strong>1. กล้าหาญ</strong> ในขั้นตอนการเล่นการ์ด คุณสามารถเลือกให้การ์ดอุบายใบแรกที่คุณใช้ไม่จำกัดระยะทางและไม่สามารถถูกตอบโต้ได้ด้วย “คงกระพันชาตรี” และจบรอบการเล่นทันที<br /><strong>2. แน่วแน่</strong> ในขั้นตอนการเล่นการ์ด คุณสามารถเลือกให้การ์ด “โจมตี” ใบแรกที่คุณใช้ไม่จำกัดระยะทางได้ และจบรอบการเล่นทันที" },
  yan_yan: { name: "เงียมหงัน", desc: "<strong>1. ป้องกันเมือง ไม่ออกรบ</strong> ทักษะสับเปลี่ยน : <br />(1.1) เมื่อคุณเป็นเป้าหมายการ์ด “โจมตี” คุณและขุนพลเป้าหมายจั่วการ์ดคนละ 1 ใบ และขุนพลนั้นจะไม่สามารถใช้การ์ดกับคุณได้อีกในรอบนี้ <br />(1.2) เมื่อคุณเลือกเป้าหมายของการ์ด “โจมตี” คุณจะได้ขโมยการ์ด 1 ใบ จากขุนพลเป้าหมาย (บนมือ, บนพื้นที่อุปกรณ์หรือพื้นที่ตัดสิน) จากนั้นคุณจะใช้การ์ดกับขุนพลนั้นไม่ได้อีกในรอบนี้" },
  wang_ji: { name: "หวังจี", desc: "<strong>1. รูปแบบระบบ</strong> เมื่อคุณเลือกเป้าหมายการเล่นการ์ด เลือกขุนพลอื่นที่ไม่ได้เป็นเป้าหมาย 1 คน สลับกันมอบการ์ดบนมือกับคุณ 1 ใบโดยที่อีกฝ่ายเป็นคนมอบให้คุณก่อน <br /><strong>2. แสวงหาความก้าวหน้า</strong> เมื่อเริ่มขั้นตอนการจบรอบ คุณสามารถจั่วการ์ดได้ 2 ใบ หากทำเช่นนั้น คุณจะต้องทิ้งการ์ดบนมือจนเหลือ 2 ใบ (หากคุณพลังชีวิตไม่เต็มคุณไม่ต้องทิ้งการ์ด)" },
  kuai_yue_and_kuai_liang: { name: "เกงอวด & เกงเหลียง", desc: "<strong>1. คู่หูที่ปรึกษา</strong> เมื่อคุณเป็นเป้าหมายของการ์ดของขุนพลอื่น คุณสามารถให้ขุนพลที่มีจำนวนการ์ดบนมือน้อยที่สุดจั่วการ์ด 1 ใบ<br /><strong>2. พลิกสถานการณ์</strong> ทักษะสับเปลี่ยน : <br />(2.1) คุณสามารถให้การ์ด 1 ใบแก่ขุนพลอื่นที่มีการ์ดในมือมากที่สุด จากนั้นสร้างความเสียหายให้แก่ขุนพลนั้น 1 หน่วย หากขุนพลตายจากทักษะนี้ คุณจะได้จั่วการ์ด 4 ใบ<br />(2.2) เมื่อขุนพลอื่นสร้างความเสียหายให้แก่คุณ มอบการ์ดให้ขุนพลนั้น 1 ใบ เมื่อจบรอบนี้ถ้าการ์ดใบนั้นยังไม่ถูกใช้ คุณจะได้จั่วการ์ด 4 ใบ" },
  wang_ping: { name: "อองเป๋ง", desc: "<strong>1. กองพลห้าวหาญ</strong> ในชั้นตอนการเล่นการ์ด คุณสามารถทิ้งการ์ด 1 ใบ จากนั้นเลือกทำ 1 อย่าง (ใช้ได้รอบละ 1 ครั้ง):<br />-	ให้ขุนพลอื่นที่มีจำนวนการ์ดในมือมากกว่าคุณมอบการ์ดให้แก่คุณ 1 ใบ<br />-	ให้ขุนพลอื่นที่มีจำนวนการ์ดในพื้นที่ติดอุปกรณ์มากกว่าคุณทิ้งการ์ดยุทโธปกรณ์ 1 ใบ<br /><strong>2. กลยุทธ์ทหาร</strong> ทักษะติดตัว : เมื่อคุณใช้ทักษะ “กองพลห้าวหาญ” หากเป้าหมายไม่ตรงกับเป้าหมายก่อนหน้า คุณจะได้จั่วการ์ด 1 ใบ" },
  lu_ji: { name: "ลกเจ๊ก", desc: "<strong>1. กตัญญู</strong> ทักษะติดตัว : เมื่อเริ่มเกม คุณจะได้รับสถานะ “กตัญญู” 3 หน่วย (ขุนพลที่มี “กตัญญู” จะได้จั่วการ์ดเพิ่ม 1 ใบในขั้นตอนจั่วการ์ดและสามารถทิ้ง “กตัญญู” 1 หน่วย เพื่อป้องกันความเสียหาย 1 หน่วยได้) <br /><strong>2. มรดก</strong> เมื่อเริ่มขั้นตอนการเล่นการ์ด คุณสามารถจ่ายพลังชีวิต 1 หน่วย หรือทิ้ง “กตัญญู” 1 หน่วย เพื่อให้ขุนพลอื่นได้รับ “กตัญญู” 1 หน่วย (ไม่สามารถให้ขุนพลที่มีอยู่แล้วได้) <br /><strong>3. โต้คารม</strong> หากคุณไม่มี “กตัญญู” เหลืออยู่ คุณสามารถข้ามขั้นตอนการจั่วการ์ดและรับ “กตัญญู” 2 หน่วย (ใช้ได้ครั้งเดียวในเกมส์)" },
  xu_you: { name: "เขาฮิว", desc: "<strong>1. ไม่เตรียมพร้อม</strong> ทักษะติดตัว : คุณจั่วการ์ดจากด้านล่างกอง <br /><strong>2. ความสามารถล้วนๆ</strong> ในรอบการเล่นการ์ด คุณสามารถแอบดูการ์ด 2 ใบสุดบนกองได้ หากคุณมีการ์ดใบเดียวกันบนมือ คุณสามารถหยิบการ์ดใบที่เหมือนกันจากกองไพ่ได้ (ใช้ได้รอบละ 1 ครั้ง) <br /><strong>3. วางแผน</strong> ทักษะสับเปลี่ยน : <br />(3.1) จั่วการ์ด 1 ใบ จากนั้นทิ้งการ์ดบนมือ 2 ใบ คุณจะไม่ตกเป็นเป้าหมายของทักษะขุนพลอื่นจนถึงรอบการเล่นรอบหน้า <br />(3.2) จั่วการ์ด 2 ใบ จากนั้นทิ้งการ์ดบนมือ 1 ใบ ทักษะติดตัวของขุนพลอื่นจะไม่ทำงานจนจบรอบการเล่นรอบนี้ของคุณ" },
  sun_liang: { name: "ซุนเหลียง", desc: "<strong>1. ลงทัณฑ์</strong> หลังจากขั้นตอนการทิ้งการ์ด สามารถเลือกได้ 1 อย่าง (X คือจำนวนการ์ดที่คุณทิ้งในขั้นตอนทิ้งการ์ดนี้): <br />- ให้ขุนพลไม่เกิน X คน จั่วการ์ด 1 ใบ <br />- สร้างความเสียหาย 1 หน่วย ให้กับขุนพลทุกคนที่มีพลังชีวิต X หน่วย หากมีมากกว่า 1 คน คุณจะได้รับความเสียหายด้วย <br /><strong>2. ราชโอรสผู้เสียอำนาจ</strong> ทักษะติดตัว : เมื่อสิ้นสุดขั้นตอนการเล่นการ์ด หากไม่ได้เล่นการ์ดในรอบนี้ สามารถให้ขุนพลที่อยู่นอกระยะโจมตี 1 คน ทิ้งการ์ด 1 ใบ <br /><strong>3. คืนตำแหน่ง</strong> ทักษะจักรพรรดิ : หลังจากที่ขุนพลง่อก๊กใช้การ์ด “โจมตี” ขุนพลนั้นสามารถให้การ์ด “โจมตี” ใบนั้นแก่คุณ หลังจากนั้นขุนพลนั้นได้จั่วการ์ด 1 ใบ" },
  lu_zhi: { name: "โลติด", desc: "<strong>1. ภัคดีตลอดไป</strong> ตั้งแต่รอบที่ 2 เป็นต้นไปหลังจากเริ่มเกม ในรอบการเล่นของคุณ คุณสามารถเลือกขุนพลบนสนาม 1 คน เพื่อสาบานตนจะรับใช้ตลอดทั้งเกมส์ (จะไม่มีใครรู้ว่าคุณสาบานตนต่อขุนพลไหน) <br />- เมื่อคุณหรือขุนพลที่คุณรับใช้เข้าสู่สถานะใกล้ตาย คุณสามารถเผยความจริงว่าคุณสาบานตนกับใคร หลังจากนั้นขุนพลอีกฝ่ายสามารถลดพลังชีวิต 1 หน่วยเพื่อฟื้นฟูพลังชึวิตให้กับขุนพลที่ใกล้ตายได้ (ใช้ได้ครั้งเดียวในเกมส์) <br />- เมื่อคุณหรือขุนพลที่คุณรับใช้ตาย คุณจะได้การ์ดทั้งหมดของอีกฝ่ายขึ้นมือ (การ์ดบนมือ, การ์ดบนพื้นที่ติดตั้งอุปกรณ์) <br /> <strong>2. ซื่อสัตย์</strong> ทักษะสับเปลี่ยน : <br />(2.1) เลือกขุนพลเป้าหมาย 1 คนที่พลังชีวิตไม่เท่ากับคุณ จากนั้นคุณทิ้งการ์ดสีแดง (<span class='red'>❤</span>/<span class='red'>◆</span>) X ใบ สร้างความเสียหาย 1 หน่วย (X เป็นผลต่างพลังชีวิตของคุณกับขุนพลเป้าหมาย) (ใช้ได้รอบละ 1 ครั้ง) <br />(2.2) นอกรอบการเล่นของคุณ เมื่อคุณใช้หรือเล่นการ์ดสีดำ (♣️/♠️) คุณสามารถให้ขุนพลอื่นจั่วการ์ด 1 ใบ " },

  // zhuge_liang_god: { name: "จูกัดเหลียง เหนือฟ้า", desc: "<strong>1. 7 ดาวนักปราชญ์</strong> เมื่อเริ่มเกมส์ คุณจะได้สถานะ “ดาวนักปราชญ์” 7 หน่วย ในรอบการเล่นการ์ด สามารถใช้ “ดาวนักปราชญ์” 1 หน่วยเพื่อทิ้งการ์ดกี่ใบก็ได้และจั่วใหม่ตามจำนวนที่ทิ้ง  <br />
}

export const initWarlords = [
  buildWarlord("hua_tuo", 3, "qun", "male"), // ฮัวโต๋ 0
  buildWarlord("lubu", 4, "qun", "male"), // ลิโป้
  buildWarlord("diao_chan", 3, "qun", "female"), // เตียวเสี้ยน
  buildWarlord("hua_xiong", 6, "qun", "male"), // ฮัวหยง
  buildWarlord("yuan_shu", 4, "qun", "male"), // อ้วนสุด

  buildWarlord("lu_meng", 4, "wu", "male"), // ลิบอง 5
  buildWarlord("da_qiao", 3, "wu", "female"), // ไต้เกี้ยว
  buildWarlord("gan_ning", 4, "wu", "male"), // กำเหลง
  buildWarlord("sun_shangxiang", 3, "wu", "female"), // ซุนฮูหยิน
  buildWarlord("huang_gai", 4, "wu", "male"), // อุยกาย
  buildWarlord("sun_quan", 4, "wu", "male"),
  buildWarlord("zhou_yu", 3, "wu", "male"), // จิวยี่
  buildWarlord("lu_xun", 3, "wu", "male"),

  buildWarlord("cao_cao", 4, "wei", "male"), // 13
  buildWarlord("guo_jia", 3, "wei", "male"), // กุยแก
  buildWarlord("sima_yi", 3, "wei", "male"), // 
  buildWarlord("zhang_liao", 4, "wei", "male"), // เตียวเลี้ยว
  buildWarlord("xu_chu", 4, "wei", "male"), // เคาทู
  buildWarlord("xiahou_dun", 4, "wei", "male"), // 
  buildWarlord("lady_zhen", 3, "wei", "female"), // เอียนสี
  
  buildWarlord("huang_yueying", 3, "shu", "female"), // หวงเยว่อิง 20
  buildWarlord("guan_yu", 4, "shu", "male"), // 
  buildWarlord("liu_bie", 4, "shu", "male"), // 
  buildWarlord("zhuge_liang", 3, "shu", "male"), // 
  buildWarlord("zhang_fei", 4, "shu", "male"), // 
  buildWarlord("ma_chao", 4, "shu", "male"), //  
  buildWarlord("zhao_yun", 4, "shu", "male"), // 

  buildWarlord("cai_wenji", 3, "qun", "female"), // ไช่ เหวินจี 27
  buildWarlord("zuo_ci", 3, "qun", "male"), // โจจู๋
  buildWarlord("yuan_shu_king", 4, "qun", "male"), // อ้วนสุด ราชา
  buildWarlord("zhang_jiao", 3, "qun", "male"), // เตียวก๊ก
  buildWarlord("tao_yin", 3, "qun", "male"), // เต๋าหยิน อิเกียด
  buildWarlord("pang_de", 4, "qun", "male"), // บังเต๊ก
  buildWarlord("dong_zhou", 8, "qun", "male"), // ตั๋งโต๊ะ
  buildWarlord("jia_xu", 3, "qun", "male"), // กาเซี่ยง

  buildWarlord("zhang_zhao", 3, "wu", "male"), // เตียวเจียว 35
  buildWarlord("lu_kang", 4, "wu", "male"), // ลกข้อง
  buildWarlord("taishi_ci", 4, "wu", "male"), // ไทสูจู้
  buildWarlord("sun_jian", 4, "wu", "male"), // ซุนเกี๋ยน
  
  buildWarlord("xu_huang", 4, "wei", "male"), // ซิหลง 39
  buildWarlord("xiahou_yuan", 4, "wei", "male"), // แฮหัวเอี๋ยน
  buildWarlord("cao_ren", 4, "wei", "male"), // โจหยิน
  buildWarlord("dian_wei", 4, "wei", "male"), // เตียนอุย
  buildWarlord("deng_ai", 4, "wei", "male"), // เตงหงาย
  buildWarlord("hao_zhao", 4, "wei", "male"), // เฮกเจียว
  buildWarlord("zhang_he", 4, "wei", "male"), // เตียวคับ
  buildWarlord("xun_yu", 3, "wei", "male"), // ซุนฮก

  buildWarlord("meng_huo", 4, "shu", "male"), // เบ้งเฮ็ก 47
  buildWarlord("zhu_rong", 4, "shu", "female"), // จกหยง
  buildWarlord("wei_yan", 4, "shu", "male"), // อุยเอี๋ยน
  buildWarlord("zhuge_liang_prime", 3, "shu", "male"), // มังกรนิทรา

  buildWarlord("lubu_god", 4, "god", "male"), // เทพแห่งสงคราม 51
  buildWarlord("guan_yu_god", 4, "god", "male"), // เทพแห่งความซื่อสัตย์
  buildWarlord("cao_cao_god", 3, "god", "male"), // สมมติเทพ
  buildWarlord("zhou_yu_god", 4, "god", "male"), // เทพผู้ถ่มน้ำลายรดฟ้า
  buildWarlord("zhang_liao_god", 4, "god", "male"), // เทพสายฟ้า

  buildWarlord("sun_ce", 4, "wu", "male"), // 56
  buildWarlord("liu_shan", 3, "shu", "male"), // อาเต๋า
  buildWarlord("jiang_wei", 4, "shu", "male"), // เกียงอุย
  buildWarlord("lu_su", 3, "wu", "male"), // โลซก
  buildWarlord("cao_pi", 3, "wei", "male"), // โจผี
  buildWarlord("zhang_xiu", 4, "qun", "male"), // เตียวสิ้ว
  buildWarlord("lady_wu", 3, "wu", "female"), // ชีฮูหยิน
  buildWarlord("zhou_tai", 4, "wu", "male"), // จิวท่าย
  buildWarlord("zhuge_zhan", 3, "shu", "male"), // จูกัดเจี๋ยม

  buildWarlord("xiao_qiao", 3, "wu", "female"), // เสี่ยวเกี้ยว 65
  buildWarlord("yuan_shao", 4, "qun", "male"), // อ้วนเสี้ยว
  buildWarlord("pang_tong", 3, "shu", "male"), // บังทอง
  buildWarlord("yan_liang_and_wen_chou", 4, "qun", "male"), // งันเหลียง & บุนทิว
  buildWarlord("huang_zhong", 4, "shu", "male"), // ฮองตง
  buildWarlord("guanqiu_jian", 4, "wei", "male"), // บู๊ขิวเขียม
  buildWarlord("chen_dao", 4, "shu", "male"), // ตันเตา
  buildWarlord("yan_yan", 4, "shu", "male"), // เงียมหงัน
  buildWarlord("wang_ji", 3, "wei", "male"), // หวังจี
  buildWarlord("kuai_yue_and_kuai_liang", 3, "wei", "male"), // เกงอวด & เกงเหลียง
  buildWarlord("wang_ping", 4, "shu", "male"), // อองเป๋ง
  buildWarlord("lu_ji", 3, "wu", "male"), // ลกเจ๊ก 
  buildWarlord("xu_you", 3, "qun", "male"), // เขาฮิว
  // buildWarlord("lu_zhi", 3, "qun", "male"), // โลติด
  buildWarlord("sun_liang", 3, "wu", "male"), // ซุนเหลียง
]